app/controllers/registrations_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("full_name", "username", "password_digest", "role_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)