app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "devcastrojunin"], ["LIMIT", 1]]
---
  def create
    user = User.find(username: params[:username])